### Operações

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
    {
        "Empresa": [1, 2, 3, 4],
        "Vendedores": ["Ana", "Joao", "Carlos", "Bia"],
        "Vendas": [120, 60, 365, 120],
    }
)

In [3]:
df.head()

   Empresa Vendedores  Vendas
0        1        Ana     120
1        2       Joao      60
2        3     Carlos     365
3        4        Bia     120

### Informações sobre dados únicos

In [4]:
df["Vendas"].unique()

array([120,  60, 365])

In [5]:
df["Vendas"].nunique()

3

In [6]:
df["Vendas"].value_counts()

Vendas
120    2
60     1
365    1
Name: count, dtype: int64

### Seleção de dados

In [7]:
novodf = df[(df["Empresa"] > 2) & (df["Vendas"] > 120)]

In [8]:
novodf

   Empresa Vendedores  Vendas
2        3     Carlos     365

### Funções

In [9]:
def multiplicacao(x):
    return x * 2

In [10]:
df["Empresa"].apply(multiplicacao)

0    2
1    4
2    6
3    8
Name: Empresa, dtype: int64

In [11]:
df["Vendas"].apply(multiplicacao)

0    240
1    120
2    730
3    240
Name: Vendas, dtype: int64

In [12]:
df["Vendedores"].apply(len)

0    3
1    4
2    6
3    3
Name: Vendedores, dtype: int64

In [13]:
df["Vendas"].sum()

665

In [14]:
df

   Empresa Vendedores  Vendas
0        1        Ana     120
1        2       Joao      60
2        3     Carlos     365
3        4        Bia     120

In [15]:
del df["Vendedores"]

In [16]:
df

   Empresa  Vendas
0        1     120
1        2      60
2        3     365
3        4     120

In [17]:
df.columns

Index(['Empresa', 'Vendas'], dtype='object')

In [18]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
df

   Empresa  Vendas
0        1     120
1        2      60
2        3     365
3        4     120

In [20]:
df.sort_values(by="Vendas")

   Empresa  Vendas
1        2      60
0        1     120
3        4     120
2        3     365

In [21]:
df.isnull()

   Empresa  Vendas
0    False   False
1    False   False
2    False   False
3    False   False

In [22]:
df.dropna()

   Empresa  Vendas
0        1     120
1        2      60
2        3     365
3        4     120

### NaN

In [23]:
import numpy as np

In [24]:
df = pd.DataFrame(
    {
        "Empresa": [1, 2, np.nan, 4],
        "Vendedores": [np.nan, "Joao", "Carlos", "Bia"],
        "Vendas": [120, 60, 365, 120],
    }
)

In [25]:
df.head()

   Empresa Vendedores  Vendas
0      1.0        NaN     120
1      2.0       Joao      60
2      NaN     Carlos     365
3      4.0        Bia     120

In [26]:
df.fillna("Preenchido")

      Empresa  Vendedores  Vendas
0         1.0  Preenchido     120
1         2.0        Joao      60
2  Preenchido      Carlos     365
3         4.0         Bia     120

### Pivot Table

In [27]:
dados = {
    "Empresas": ["A", "A", "A", "B", "B", "B"],
    "Vendedores": ["Bia", "Bia", "Bia", "João", "João", "João"],
    "Produtos": [
        "salgados",
        "doces",
        "salgados",
        "doces",
        "salgados",
        "doces",
    ],
    "Vendas": [20, 40, 50, 30, 70, 55],
}

In [28]:
df = pd.DataFrame(dados)

In [29]:
df

  Empresas Vendedores  Produtos  Vendas
0        A        Bia  salgados      20
1        A        Bia     doces      40
2        A        Bia  salgados      50
3        B       João     doces      30
4        B       João  salgados      70
5        B       João     doces      55

In [30]:
df.pivot_table(
    values="Vendas", index=["Empresas", "Vendedores"], columns="Produtos"
)

Produtos             doces  salgados
Empresas Vendedores
A        Bia          40.0      35.0
B        João         42.5      70.0